ScottyGammon/7Week/2Dw7/devise_lab/app/controllers/contacts_controller.rb

SELECT "contacts".* FROM "contacts"
---
  def index
    @contacts = Contact.all