louiechristie/w7d2/planets_app/app/controllers/planets_controller.rb

  def create
   Planet.create(params["planet"])
---
INSERT INTO "planets" ("created_at", "image", "mass", "moons", "name", "orbit", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["created_at", Wed, 16 Apr 2014 15:12:30 UTC +00:00], ["image", nil], ["mass", nil], ["moons", nil], ["name", nil], ["orbit", nil], ["updated_at", Wed, 16 Apr 2014 15:12:30 UTC +00:00]]

  def show
    @planet = Planet.find(params[:id])
---
SELECT "planets".* FROM "planets" WHERE "planets"."id" = ? LIMIT 1  [["id", "4"]]

  def destroy
    Planet.find(params[:id]).destroy
---
DELETE FROM "planets" WHERE "planets"."id" = ?  [["id", 7]]
SELECT "planets".* FROM "planets" WHERE "planets"."id" = ? LIMIT 1  [["id", "7"]]